Revit 2024 API
DeleteWorksetSettings Constructor (DeleteWorksetOption, WorksetId)
 Constructs a DeleteWorksetSettings object.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2022.1
Syntax
C#
public DeleteWorksetSettings(
	DeleteWorksetOption deleteWorksetOption,
	WorksetId elementsMoveInto
)
Visual Basic
Public Sub New ( _
	deleteWorksetOption As DeleteWorksetOption, _
	elementsMoveInto As WorksetId _
)
Visual C++
public:
DeleteWorksetSettings(
	DeleteWorksetOption deleteWorksetOption,
	WorksetId^ elementsMoveInto
)
Parameters
deleteWorksetOption
Type: Autodesk.Revit.DB.DeleteWorksetOption
elementsMoveInto
Type: Autodesk.Revit.DB.WorksetId
Remarks
 elementsMoveInto only takes effect when DeleteWorksetOption::Enum is MoveElementsToWorkset.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
DeleteWorksetSettings Class
DeleteWorksetSettings Overload
Autodesk.Revit.DB Namespace